article/16.typescript-learning-notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-02-09 Sat 21:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>学习 Typescript 的笔记</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
</head>
<body>
<div id="content">
<h1 class="title">学习 Typescript 的笔记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf59e880">1. 笔记</a>
<ul>
<li><a href="#orgb39ef18">1.1. let 和 var 的区别</a>
<ul>
<li><a href="#org2fbf698">1.1.1. 不同作用域</a></li>
<li><a href="#org91c029e">1.1.2. 重定义及屏蔽</a></li>
</ul>
</li>
<li><a href="#orgc836c5a">1.2. 函数传参</a>
<ul>
<li><a href="#org97cf838">1.2.1. 可选参数和默认参数</a></li>
<li><a href="#org426b82b">1.2.2. 边长参数</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org829f560">2. 参考链接</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgf59e880" class="outline-2">
<h2 id="orgf59e880"><span class="section-number-2">1</span> 笔记</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgb39ef18" class="outline-3">
<h3 id="orgb39ef18"><span class="section-number-3">1.1</span> let 和 var 的区别</h3>
<div class="outline-text-3" id="text-1-1">
<p>
let 和 var 两个关键字都可以定义变量，两者的主要区别是他们的作用域不一样的。 var
是函数作用域， let 是块作用域。
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #859900;">function</span> <span style="color: #b58900;">f</span>(<span style="color: #6c71c4;">shouldInitialize</span>: <span style="color: #268bd2;">boolean</span>) {
  <span style="color: #859900;">if</span> (shouldInitialize) {
    <span style="color: #859900;">var</span> <span style="color: #6c71c4;">x</span> = 10; <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">&#36825;&#37324;&#22914;&#26524;&#29992; let &#23450;&#20041;&#21017; return &#23601;&#19981;&#33021;&#36820;&#22238; x</span>
  }

  <span style="color: #859900;">return</span> x;
}

f(<span style="color: #268bd2;">true</span>);  <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">returns '10'</span>
f(<span style="color: #268bd2;">false</span>); <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">returns 'undefined'</span>
</pre>
</div>
</div>

<div id="outline-container-org2fbf698" class="outline-4">
<h4 id="org2fbf698"><span class="section-number-4">1.1.1</span> 不同作用域</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
var 声明可以在包含它的函数，模块，命名空间或全局作用域内部任何位置被访问。这里会
引起一些不易察觉的错误，
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">i &#34987;&#37325;&#22797;&#23450;&#20041;</span>
<span style="color: #859900;">function</span> <span style="color: #b58900;">sumMatrix</span>(<span style="color: #6c71c4;">matrix</span>: <span style="color: #6c71c4;">number</span>[][]) {
  <span style="color: #859900;">var</span> <span style="color: #6c71c4;">sum</span> = 0;
  <span style="color: #859900;">for</span> (<span style="color: #859900;">var</span> <span style="color: #6c71c4;">i</span> = 0; i &lt; matrix.length; i++) {
    <span style="color: #859900;">var</span> <span style="color: #6c71c4;">currentRow</span> = matrix[i];
    <span style="color: #859900;">for</span> (<span style="color: #859900;">var</span> <span style="color: #6c71c4;">i</span> = 0; i &lt; currentRow.length; i++) {
      sum += currentRow[i];
    }
  }

  <span style="color: #859900;">return</span> sum;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">&#27599;&#27425;&#23450;&#20041;&#30340; i &#21482;&#20250;&#24341;&#29992;&#26368;&#21518;&#30340;&#21464;&#37327;</span>
<span style="color: #859900;">for</span> (<span style="color: #859900;">var</span> <span style="color: #6c71c4;">i</span> = 0; i &lt; 5; i++) {
  setTimeout(<span style="color: #859900;">function</span>() { console.log(i); }, 100 * i);
}
<span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">output:</span>
<span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">5</span>
<span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">5</span>
<span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">5</span>
<span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">5</span>
<span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">5</span>

<span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">&#35299;&#20915;&#26041;&#26696;&#26159;&#20351;&#29992; lambda &#20989;&#25968;&#26469;&#25193;&#20805;&#23450;&#20041;&#22495;</span>
<span style="color: #859900;">for</span> (<span style="color: #859900;">var</span> <span style="color: #6c71c4;">i</span> = 0; i &lt; 5; i++) {
  (<span style="color: #859900;">function</span>(<span style="color: #6c71c4;">i</span>) {
    setTimeout(<span style="color: #859900;">function</span>() { console.log(i); }, 100 * i);
  })(i);
}
<span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">output:</span>
<span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">1</span>
<span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">2</span>
<span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">3</span>
<span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">4</span>
<span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">5</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org91c029e" class="outline-4">
<h4 id="org91c029e"><span class="section-number-4">1.1.2</span> 重定义及屏蔽</h4>
<div class="outline-text-4" id="text-1-1-2">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #859900;">function</span> <span style="color: #b58900;">f</span>(<span style="color: #6c71c4;">x</span>) {
    <span style="color: #859900;">var</span> <span style="color: #6c71c4;">x</span>;
    <span style="color: #859900;">var</span> <span style="color: #6c71c4;">x</span>; <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">&#21487;&#20197;&#23450;&#20041;</span>
    <span style="color: #859900;">if</span> (<span style="color: #268bd2;">true</span>) {
        <span style="color: #859900;">var</span> <span style="color: #6c71c4;">x</span>;
    }
}

<span style="color: #859900;">let</span> <span style="color: #6c71c4;">x</span> = 10;
<span style="color: #859900;">let</span> <span style="color: #6c71c4;">x</span> = 20; <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">&#38169;&#35823;&#65292;&#19981;&#33021;&#22312;1&#20010;&#20316;&#29992;&#22495;&#37324;&#22810;&#27425;&#22768;&#26126;`x`</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc836c5a" class="outline-3">
<h3 id="orgc836c5a"><span class="section-number-3">1.2</span> 函数传参</h3>
<div class="outline-text-3" id="text-1-2">
<p>
TypeScript 里的每个函数参数都是必须的。 这不是指不能传递 null 或 undefined 作为
参数，而是说编译器检查用户是否为每个参数都传入了值。 编译器还会假设只有这些参数
会被传递进函数。简短地说，传递给一个函数的参数个数必须与函数期望的参数个数一致。
</p>
</div>

<div id="outline-container-org97cf838" class="outline-4">
<h4 id="org97cf838"><span class="section-number-4">1.2.1</span> 可选参数和默认参数</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
JavaScript 里，每个参数都是可选的，可传可不传。 没传参的时候，它的值就是
undefined 。在 TypeScript 里我们可以在参数名旁使用 ? 实现可选参数的功能。 比如，
我们想让 lastName 是可选的：
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">&#21487;&#36873;&#21442;&#25968;</span>
<span style="color: #859900;">function</span> <span style="color: #b58900;">buildName</span>(<span style="color: #6c71c4;">firstName</span>: <span style="color: #6c71c4;">string</span>, <span style="color: #6c71c4;">lastName</span>?: <span style="color: #6c71c4;">string</span>) {
  <span style="color: #859900;">if</span> (lastName)
    <span style="color: #859900;">return</span> firstName + <span style="color: #2aa198;">" "</span> + lastName;
  <span style="color: #859900;">else</span>
    <span style="color: #859900;">return</span> firstName;
}

<span style="color: #859900;">let</span> <span style="color: #6c71c4;">result1</span> = buildName(<span style="color: #2aa198;">"Bob"</span>);  <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">works correctly now</span>
<span style="color: #859900;">let</span> <span style="color: #6c71c4;">result2</span> = buildName(<span style="color: #2aa198;">"Bob"</span>, <span style="color: #2aa198;">"Adams"</span>, <span style="color: #2aa198;">"Sr."</span>);  <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">error, too many parameters</span>
<span style="color: #859900;">let</span> <span style="color: #6c71c4;">result3</span> = buildName(<span style="color: #2aa198;">"Bob"</span>, <span style="color: #2aa198;">"Adams"</span>);  <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">ah, just right</span>

<span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">&#40664;&#35748;&#21442;&#25968;</span>
<span style="color: #859900;">function</span> <span style="color: #b58900;">buildName</span>(<span style="color: #6c71c4;">firstName</span>: <span style="color: #6c71c4;">string</span>, <span style="color: #6c71c4;">lastName</span> = <span style="color: #2aa198;">"Smith"</span>) {
  <span style="color: #859900;">return</span> firstName + <span style="color: #2aa198;">" "</span> + lastName;
}

<span style="color: #859900;">let</span> <span style="color: #6c71c4;">result1</span> = buildName(<span style="color: #2aa198;">"Bob"</span>);                  <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">works correctly now, returns "Bob Smith"</span>
<span style="color: #859900;">let</span> <span style="color: #6c71c4;">result2</span> = buildName(<span style="color: #2aa198;">"Bob"</span>, <span style="color: #268bd2;">undefined</span>);       <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">still works, also returns "Bob Smith"</span>
<span style="color: #859900;">let</span> <span style="color: #6c71c4;">result3</span> = buildName(<span style="color: #2aa198;">"Bob"</span>, <span style="color: #2aa198;">"Adams"</span>, <span style="color: #2aa198;">"Sr."</span>);  <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">error, too many parameters</span>
<span style="color: #859900;">let</span> <span style="color: #6c71c4;">result4</span> = buildName(<span style="color: #2aa198;">"Bob"</span>, <span style="color: #2aa198;">"Adams"</span>);         <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">ah, just right</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org426b82b" class="outline-4">
<h4 id="org426b82b"><span class="section-number-4">1.2.2</span> 边长参数</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
在 TypeScript 里，你可以把所有参数收集到一个变量里， 剩余参数会被当做个数不限的
可选参数。 可以一个都没有，同样也可以有任意个。 编译器创建参数数组，名字是你在省
略号 <b>&#x2026;</b> 后面给定的名字，你可以在函数体内使用这个数组。
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #859900;">function</span> <span style="color: #b58900;">buildName</span>(<span style="color: #6c71c4;">firstName</span>: <span style="color: #6c71c4;">string</span>, ...<span style="color: #6c71c4;">restOfName</span>: <span style="color: #6c71c4;">string</span>[]) {
  <span style="color: #859900;">return</span> firstName + <span style="color: #2aa198;">" "</span> + restOfName.join(<span style="color: #2aa198;">" "</span>);
}

<span style="color: #859900;">let</span> <span style="color: #6c71c4;">employeeName</span> = buildName(<span style="color: #2aa198;">"Joseph"</span>, <span style="color: #2aa198;">"Samuel"</span>, <span style="color: #2aa198;">"Lucas"</span>, <span style="color: #2aa198;">"MacKinzie"</span>);
</pre>
</div>
</div>
</div>
</div>
</div>


<div id="outline-container-org829f560" class="outline-2">
<h2 id="org829f560"><span class="section-number-2">2</span> 参考链接</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li><a href="https://www.tslang.cn/docs/handbook/typescript-in-5-minutes.html">5分钟上手TypeScript</a>，typescript中文官网</li>
<li><a href="http://www.typescriptlang.org/docs/home.html">Typescript Documentation</a></li>
<li><a href="https://www.tslang.cn/index.html#download-links">TypeScript 实战视频</a></li>
<li><a href="https://www.tslang.cn/docs/handbook/basic-types.html">TypeScript 文档</a></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-10-11 Thu 00:00</p>
<p class="author">Author: Jinghui Hu</p>
<p class="date">Created: 2019-02-09 Sat 21:41</p>
</div>
</body>
</html>
